app/Controllers/Member.php

SELECT *
FROM `tb_member`
WHERE `flag` = '1'
SELECT *
FROM `user`
WHERE `user`.`id` = '2'
---
    public function index()
    {
        $uri = service('uri');
        $flag = $uri->getSegment(2);
        if($flag == 0){
            $tit = "Member Registration";
        }else{
            $tit = "Member User";
        }
        $data = [
            'title' => $tit,
            'user_logged_in' => $this->userModel->find($this->session->get('id')),
            'memberActive' => $this->memberModel->countMemberByFlag(1),
            'memberAll' => $this->memberModel->countMemberAll(),
            'getData' => $this->memberModel->where('flag', '1')->findAll(),
            'session' => \Config\Services::session()
        ];