app/Models/MemberModel.php

SELECT *
FROM `tb_member`
WHERE `flag` = '0'
ORDER BY `id` DESC
 LIMIT 10
---
    public function getDatatables($flag)
    {
        $request = service('request');
        $length = $request->getPost('length') ?? 10;
        $start = $request->getPost('start') ?? 0;

        $builder = $this->_getDatatablesQuery($flag);
        $builder->limit($length, $start);

        return $builder->get()->getResult(); // Return data as objects

SELECT COUNT(*) AS `numrows`
FROM `tb_member`
WHERE `flag` = '0'
---
    public function countFiltered($flag)
    {
        return $this->_getDatatablesQuery($flag)->countAllResults(false);

SELECT COUNT(*) AS `numrows` FROM `tb_member`
---
    public function countAll()
    {

        return $this->db->table($this->table)->countAll();

SELECT *
FROM `tb_member`
WHERE `flag` = 1
---
    public function countMemberByFlag($flag){
        $builder = $this->db->table('tb_member');
        $builder->where('flag', $flag);
        $query = $builder->get()->getNumRows();